Autodesk.Revit.DB.TriOrQuadFacet.GetVertexIndex(System.Int32)
Returns the index of the specified vertex of this facet (as an index into the external array
of vertices in the TriangulationInterface that was used to create the list of TriOrQuadFacets).
index:
Index of the desired vertex in this TriOrQuadFacet (between 0 and NumberOfVertices-1, inclusive).
Returns:
The index of the specified vertex in the external array of vertices (only valid if NumberOfVertices >= 3).
Throws Autodesk.Revit.Exceptions.ArgumentException:
index is out of range..
Since:
2013

Autodesk.Revit.DB.TriOrQuadFacet.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.TriOrQuadFacet.Normal
A unit normal vector for this facet.
Since:
2013

Autodesk.Revit.DB.TriOrQuadFacet.NumberOfVertices
The number of vertices (3 for a triangle, 4 for a quadrilateral, 0 for an unset TriOrQuadFacet).
Since:
2013

Autodesk.Revit.DB.TriOrQuadFacet
This class represents a triangle or quadrilateral in a faceted structure.
Remarks:
This class defines a triangle or quadrilateral with reference to an external triangulation structure.
The vertices of this TriOrQuadFacet are indices into the triangulation structure's array of vertices.
Since:
2013